#Задача №3450. Квадрат числа.
#Число 179 записали 50 раз подряд. Полученное 150-значное число возвели в квадрат. Сколько получилось?

a = ('179'*50)
result = int(a)**2
print(result)